const codeMessage = {
  200: 'نجح الخادم في إرجاع البيانات المطلوبة.',
  201: 'تم إنشاء البيانات أو تعديلها بنجاح.',
  202: 'دخل الطلب في قائمة الانتظار الخلفية (مهمة غير متزامنة).',
  204: 'تم حذف البيانات بنجاح.',
  400: 'حدث خطأ في الطلب المرسل، ولم يقم الخادم بإنشاء البيانات أو تعديلها.',
  401: 'المدير لا يملك الإذن، يرجى محاولة تسجيل الدخول مرة أخرى.',
  403: 'المدير مخول، ولكن الوصول ممنوع.',
  404: 'الطلب المرسل لسجل غير موجود، والخادم لا يعمل.',
  406: 'التنسيق المطلوب غير متاح.',
  410: 'تم حذف المورد المطلوب نهائياً ولن يكون متاحاً بعد الآن.',
  422: 'حدث خطأ في التحقق عند إنشاء كائن.',
  500: 'حدث خطأ في الخادم، يرجى التحقق من الخادم.',
  502: 'خطأ في البوابة.',
  503: 'الخدمة غير متوفرة، الخادم محمل بشكل زائد مؤقتاً أو قيد الصيانة.',
  504: 'انتهت مهلة البوابه.',
};

export default codeMessage;
